InformationRegisters/КонтактЦентрВходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КонтактЦентрВходящее</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтоОбсуждениеМессенджера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтКого</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникВходящегоКонтактЦентр</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактЦентрВходящее/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ДанныеВходящегоПоИсточнику(Источник) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактЦентрВходящее.Источник КАК Источник,
	|	КонтактЦентрВходящее.Ответственный КАК Ответственный,
	|	КонтактЦентрВходящее.ЭтоОбсуждениеМессенджера КАК ЭтоОбсуждениеМессенджера,
	|	КонтактЦентрВходящее.Описание КАК Описание,
	|	КонтактЦентрВходящее.ОтКого КАК ОтКого,
	|	КонтактЦентрВходящее.ТипВнешнейСистемы КАК ТипВнешнейСистемы
	|ИЗ
	|	РегистрСведений.КонтактЦентрВходящее КАК КонтактЦентрВходящее
	|ГДЕ
	|	КонтактЦентрВходящее.Источник = &Источник";
	
	Запрос.УстановитьПараметр("Источник", Источник);
	Выборка = Запрос.Выполнить().Выбрать();
	Описание = КонтактЦентр.ОписаниеВходящего();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Описание, Выборка);
		Возврат Описание;
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#КонецЕсли
